<a href="https://colab.research.google.com/github/AndreyV80/NetStudy/blob/main/PandasProjectWork.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.

In [16]:
import pandas as pd
import numpy as np


import os, time
from google.colab import drive

In [ ]:
drive.mount('/content/drive')               # подключение к google disk, куда загружены файла с  https://grouplens.org/datasets/movielens/

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
movies = pd.read_csv('/content/drive/My Drive/movies.csv')        # загуржаем файл с фильмами
movies.head()

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

In [ ]:
ratings = pd.read_csv('/content/drive/My Drive/ratings.csv') # загружаем файл с рейтигом
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
movies_ratings = movies.merge(ratings, left_on='movieId', right_on='movieId', how='inner') # объединяем файлы
movies_ratings.head()

   movieId             title  ... rating   timestamp
0        1  Toy Story (1995)  ...    4.0   964982703
1        1  Toy Story (1995)  ...    4.0   847434962
2        1  Toy Story (1995)  ...    4.5  1106635946
3        1  Toy Story (1995)  ...    2.5  1510577970
4        1  Toy Story (1995)  ...    4.5  1305696483

[5 rows x 6 columns]

In [ ]:
movies_balls = movies_ratings.query('rating == 5.0')      # сортируем файлы по максимальному баллу
movies_balls.head()

    movieId             title  ... rating  timestamp
9         1  Toy Story (1995)  ...    5.0  850466616
12        1  Toy Story (1995)  ...    5.0  832058959
13        1  Toy Story (1995)  ...    5.0  848993983
16        1  Toy Story (1995)  ...    5.0  834787906
19        1  Toy Story (1995)  ...    5.0  965796031

[5 rows x 6 columns]

In [ ]:
movies_balls['title'].unique()

array(['Toy Story (1995)', 'Jumanji (1995)', 'Grumpier Old Men (1995)',
       ..., 'Deadpool 2 (2018)', 'Solo: A Star Wars Story (2018)',
       "Won't You Be My Neighbor? (2018)"], dtype=object)

In [ ]:
movies_balls.sort_values('rating', ascending=False).head()

       movieId                   title  ... rating   timestamp
9            1        Toy Story (1995)  ...    5.0   850466616
55288     3543            Diner (1982)  ...    5.0   975212259
55217     3535  American Psycho (2000)  ...    5.0  1172008077
55220     3535  American Psycho (2000)  ...    5.0  1518768059
55221     3535  American Psycho (2000)  ...    5.0  1186084915

[5 rows x 6 columns]

In [ ]:
result = movies_balls['title'].value_counts()   # определяем максимальное вхождение элементов по столбцу 'title', выводим первую строчку таблицы с фильмом с максимальным количеством 5-балльных оценок.
result.head(1)

Shawshank Redemption, The (1994)    153
Name: title, dtype: int64

In [ ]:
result.idxmax() # или так...

'Shawshank Redemption, The (1994)'

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [ ]:
power = pd.read_csv('/content/drive/My Drive/power.csv') # загрузка данных
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
power['country'].unique()                # просматриваем уникальные названия государств

'Latvia'  'Lithuania'   'Estonia'

In [ ]:
power[ power['country'].str.contains('Esto' and 'Lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [ ]:
countries = power[((power['country']=='Latvia') | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')) & ((power['quantity'] >= 0))]
countries.head()
# фильтр на страны Прибалтики, quantity не отрицательное

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [ ]:
countries_categ = countries[(countries['category'] == 4) | (power['category'] == 12) | (power['category'] == 21)]
countries_categ.head()
# фильтруем по заявленным категориям

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [ ]:
# фильтруем по заявленным годам
countries_year = countries_categ[(countries_categ['year'] >= 2005) & (countries_categ['year'] <= 2010)]
countries_year.head()
# Выводи данные по странам Прибалтики (общие и отдельно для проверки)
print(countries_year.groupby('country')['quantity'].sum(), '\n' + 'Общий размер потребления энергии странами Прибалтики: ', countries_year['quantity'].sum())

country
Estonia       63440.0
Latvia        54844.0
Lithuania    122296.0
Name: quantity, dtype: float64
Общий размер потребления энергии странами Прибалтики:  240580.0

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

https://covid-stat.com/ru/

In [47]:

tables = pd.read_html('https://covid-stat.com/ru', encoding='utf-8')     # получается тип list - ?
tables[0].head()

  Страны и территории  Всего случаев  ...  Умерло (%)  Количество тестов
0                 США       31990143  ...        1.8%          420822699
1               Индия       13689453  ...        1.2%          259207108
2            Бразилия       13521409  ...        2.6%           28600000
3             Франция        5067216  ...          2%           70140847
4              Россия        4657883  ...        2.2%          124100000

[5 rows x 12 columns]

In [54]:
nf_tables = tables[0]         # nf_tables, как видно ниже получает тип DataFrame, почему так - не уловил.

In [56]:
nf_tables.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Страны и территории  215 non-null    object
 1   Всего случаев        215 non-null    int64
 2   13.04                76 non-null     float64
 3   Зараженные           215 non-null    int64
 4   13.04.1              79 non-null     float64
 5   Вылечилось           215 non-null    int64
 6   13.04.2              65 non-null     float64
 7   Вылечилось (%)       215 non-null    object
 8   Умерло               215 non-null    int64
 9   13.04.3              51 non-null     float64
 10  Умерло (%)           215 non-null    object
 11  Количество тестов    215 non-null    int64
dtypes: float64(4), int64(5), object(3)
memory usage: 20.3+ KB